rating = int(input("Введите рейтинг от 1 до 10: "))

match rating:
    case 9 | 10 :
        recommendation = "Настоятельно рекомендую"
        description = "Отличный результат"
        emoji = "😍"
    case 6 | 7 | 8 :
        recommendation = "Рекомендую"
        description = "Неплохой результат"
        emoji = "😊"
    case 4 | 5 :
        description = "Сердный результат"
        recommendation = "Можно попробовать"
        emoji = "😒"
    case 1 | 2 | 3 :
        recommendation = "Не рекомендую!!!"
        description = "Плохой результат"
        emoji = "😵"
    case _:
        print("Ошибка! Введите число от 1 до 10")

print("Результат вашей оценки:")
print(f"Ваш рейтинг: {rating}")
print(f"Описание: {description}")
print(f"Эмодзи: {emoji}")
print(f"Рекомендация: {recommendation}")