coffe = 120 #цены
tea = 80
juice = 100
water = 50
lemonade = 90

print("=" * 30)
#меню
print("Меню кафе:")
print("1. Кофе ☕ - 120 руб")
print("2. Чай 🍵 - 80 руб")
print("3. Сок 🧃 - 100 руб")
print("4. Вода 💧 - 50 руб")
print("5. Лимонад 🥤 - 90 руб")
print("=" * 30)

drink = input("Введите напиток:")
quantity = int(input("Введите количество порций (цифрами, максимальное количество 10):"))
discount_code = input ("Введите код скидки(при наличии, если нет пропустите)")

match drink:
    case "1" | "кофе" | "Кофе" | "кофе☕" | "Кофе☕":
        drink = "Кофе ☕"
        price = coffe
    case "2" | "чай" | "Чай" | "чай🍵" | "Чай🍵":
        drink = "Чай 🍵"
        price = tea
    case "3" | "сок" | "Сок" | "сок🧃" | "Сок🧃":
        drink = "Сок 🧃"
        price = juice
    case "4" | "вода" | "Вода" | "вода💧" | "Вода💧":
        drink = "Вода 💧"
        price = water
    case "5" | "лимонад"  "Лимонад" | "лимонад🥤" | "Лимонад🥤":
        drink = "Лимонад 🥤"
        price = lemonade
    case _:
        drink = "Неизвестный напиток"
        price = 0

if quantity == 1:
    portion = "порция"
elif 2 <= quantity <= 4:
    portion = "порции"
else:
    portion = "порций"

total = price * quantity #итоговая цена без скидки

match discount_code:
    case "студент":
        discount = total * 0.2
    case "сотрудник":
        discount = total * 0.3
    case _:
        discount = 0

total_with_discount = total - discount

print("=== ВАШ ЗАКАЗ ===")
print(f"Напиток: {drink}")
print(f"Цена: {price} руб")
print(f"Количество: {quantity} {portion}")
print(f"Сумма: {total_with_discount} руб")
